#include <stdio.h>
#include <stdlib.h>

int main(int argc, char* argv[]){
    int n = atoi(*(argv+1)); // степень первого многочлена, вводится через аргументы в консоли
    int m = atoi(*(argv+2)); // степень второго многочлена
    int *p1 = malloc(sizeof(int)* (n+1)); // выделяем память под коэффициенты первого многочлена
    int *p2 = malloc(sizeof(int)* (m+1)); // выделяем память под коэффициенты второго многочлена
    for (int i = 0; i<=n; i++){
        scanf("%i", (p1+i)); // считываем коэффициенты
    }
    for (int i = 0; i<=m; i++){
        scanf("%i", (p2+i)); // считываем коэффициенты
    }
    int *res = calloc(n+m+1, sizeof(int)); // выделям память под коэффициенты результата, calloc потому что он обуляет память (заранее заполняет массив нулями)
    for (int i = 0; i<=n; i++){
        for (int j = 0; j<=m; j++){
            *(res+i+j) += (*(p1+i))*(*(p2+j)); // для каждого произведения вычисляем новую степень как сумму степеней и новый коэффициент как произведение коэффициентов
        }
    }
    for (int i = 0; i< n+m; i++){
        if (*(res+i) != 0){
            printf("%ix^%i + ", *(res+i), n+m-i); // выводим результат
        }
    }
    printf("%i", *(res+n+m));
}